Repository: translate5/translate5
Catalog: application/modules/editor/testcases/editorAPI/Translate3117Test/resource1.tmx
Source language: de_de
Languages: en_uk, en_us

source: So entwickelt MittagQI Portale für Übersetzungsdienstleister und veröffentlichte 2012 mit "translate5" das erste Open Source Werkzeug für Online-Lektorate und Postediting, welches inzwischen auf Basis eines von ihm initierten Crowdfundings zu einem vollwertigen community-basierten Übersetzungswerkzeug geworden ist.
en_us: MittagQI is developing portals for translation service providers and, in 2012, published the first open source online review and postediting tool with “translate5”. Meanwhile, translate5 turned into a full-blown community-based translation tool, based on a crowdfunding initialized by Marc.

source: Ein besonderes Anliegen ist es Marc Mittag, auf Basis von Open Source Zusammenarbeit und gegenseitige Unterstützung von Dienstleistern und Industrieunternehmen im Übersetzungsbereich zu fördern.
en_us: A special concern of Marc Mittag is to promote collaboration and mutual support of service providers and industrial companies in the field of translation on the basis of open source.

source: Er versteht sich dabei als Koordinator und Katalysator um die Zusammenarbeit zu ermöglich und fruchtbar zu gestalten und Unternehmen zu ermöglich, auf Basis von Open Source Ihre Software und ihre Prozesse so zu gestalten, wie sie es benötigen.
en_us: He sees himself as a coordinator and catalyst to make cooperation possible and fruitful and to enable companies to design their software and their processes as they need it based on open source.

source: Zudem unterrichtet er "Yoga for business" vor dem Hintergrund einer eigenen 20-jährigen täglichen Yoga- und Meditationspraxis.
en_us: In addition, he is teaching “Yoga for business” against the backdrop of his own daily yoga and meditation practice of 20 years.

source: Unser Produktportfolio: translate5, Übersetzungsportale & Prozessautomatisierung sowie E-Commerce-Shop-Lösungen
en_us: Our Product Portfolio: translate5, translation portals & process automation and E-Commerce-Shop solutions

source: Da wir aber mit weit verbreiteten hochentwickelten Softwarebibliotheken, Systemen und Programmiersprachen arbeiten, sind auch andere Entwicklungen jederzeit möglich !
en_us: However, since we are working with highly developed software libraries, systems, and programming languages widespread on the market, other developments are also possible at any time !

source: Mit translate5 entwickelt MittagQI ein web- bzw. cloud-basiertes Übersetzungssystem für Lektoren und Übersetzer, der Maßstäbe setzt:
en_us: With translate5 MittagQI develops a web- or cloud-based translation system for proofreaders and translators, which sets standards:

source: Aufgrund seiner Usability wird es von Nutzern besonders bei Lektoraten anderen Systemen vorgezogen
en_us: Because of its usability, it is preferred by users to other systems, especially when it comes to editing

source: Alle Benutzerinteraktionen mit dem Server sind qua Design auch per API durch eine andere Software steuerbar
en_us: All user interactions with the server are controllable via API by design

source: Externe Funktionalitäten anderer Systeme können und werden auf einfache Art mittels Plug-ins als Micro-Services integriert
en_us: External functionality of other systems can easily integrated as micro services via plug-ins

source: Hier finden Sie einen Überblick der Perpektiven, die translate5 Ihnen bietet!
en_us: The following shows an overview, what translate5 offers to you!

source: Übersetzungsportale & Prozessautomatisierung
en_us: Translation portals & process automation

source: Sat Nam - Yoga, Musik, Yoga-Kleidung und mehr
en_us: Sat Nam — yoga, music, yoga attire, and more

source: Wir betreuen und entwickeln seit vielen Jahren E-Commerce-Shoplösungen.
en_us: For many years, we have been serving and developing e-commerce shop solutions.

source: Ein Beispiel unserer Arbeit ist der Shop von satnam.de.
en_us: An example of our work is the shop of satnam.de.

source: Dieser Shop wurde in enger Kooperation mit unserem Kunden und Jochen Gewecke, einem befreundeten Grafiker entwickelt - hinsichtlich Technik, Struktur und Design.
en_us: This shop has been built in close cooperation with our customer and Jochen Gewecke, a graphic designer.

source: So setzten wir im Javascript-Bereich auf ExtJs, für PHP auf Zend Framework und für Unit-Testing auf phpUnit.
en_us: Thus, we rely on ExtJs as JavaScript framework, for PHP on Zend Framework and for unit testing on phpUnit.

source: Automatisiertes Testing mit phpUnit und Schnittstellen-Testing
en_us: Automated Testing with phpUnit and interface testing

source: Eine auf kontinuierliche Weiterentwicklung angelegte größere Software mit Tests zu hinterlegen ist heutzutage Pflicht.
en_us: A larger software whose development should continue, should always be deposited with tests nowadays.

source: Nur so kann gewährleistet werden, dass bestehende Funktionalität auch bei kontinuierlicher Weiterentwicklung weiter verlässlich das tut, was man von ihr erwartet.
en_us: Only by doing to can be ensured, that existing functionality reliable continues to do, what one expects it to do.

source: Schnittstellen
en_us: Interfaces

source: Across nahtlos in Ihre Prozesse integrieren
en_us: Seamlessly integrate Across in your processes

source: Möchten Sie Ihre Redaktions- und Übersetzungsprozesse nahtlos miteinander verknüpfen?
en_us: Would you like to seamlessly combine editorial and translation processes?

source: Oder planen Sie, Ihre Lieferkette kontrolliert und zweckgebunden für die externe Bearbeitung zu öffnen?
en_us: Do you plan to open your supply chain in a controlled and purposeful manner in order to enable external processing?

source: Durch die Zusammenarbeit mit Technologiepartnern und der Verknüpfung unseres Fachwissens können wir unseren Kunden erstklassige Lösungen für ihre individuellen Prozesse und Anforderungen bieten.
en_us: Thanks to our collaboration with technology partners and the combination of our expertise, we are able to offer our customers first-class solutions for their individual processes and requirements.

source: Verschaffen Sie sich einen Überblick, wie Sie Ihre Übersetzungsprozesse durch die Anbindung korrespondierender Systeme optimieren können und Ihr Across-Ökosystem um spannende Möglichkeiten erweitern.
en_us: Optimize your translation processes by connecting interacting systems and add exciting features to your Across ecosystem.

source: Alle
en_us: All

source: Maschinelle Übersetzung
en_us: Machine Translation

source: Redaktion
en_us: Editorial system
